grevaillot/svd_tools/headers/ATSAMV71J20/pioa.h
/** @defgroup pioa_pio_ppder PIOPPDER Pad Pull-down Enable Register
@{*/

/** PIOA_PIO_PPDER_P31 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P31		(1 << 31)
/** PIOA_PIO_PPDER_P30 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P30		(1 << 30)
/** PIOA_PIO_PPDER_P29 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P29		(1 << 29)
/** PIOA_PIO_PPDER_P28 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P28		(1 << 28)
/** PIOA_PIO_PPDER_P27 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P27		(1 << 27)
/** PIOA_PIO_PPDER_P26 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P26		(1 << 26)
/** PIOA_PIO_PPDER_P25 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P25		(1 << 25)
/** PIOA_PIO_PPDER_P24 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P24		(1 << 24)
/** PIOA_PIO_PPDER_P23 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P23		(1 << 23)
/** PIOA_PIO_PPDER_P22 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P22		(1 << 22)
/** PIOA_PIO_PPDER_P21 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P21		(1 << 21)
/** PIOA_PIO_PPDER_P20 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P20		(1 << 20)
/** PIOA_PIO_PPDER_P19 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P19		(1 << 19)
/** PIOA_PIO_PPDER_P18 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P18		(1 << 18)
/** PIOA_PIO_PPDER_P17 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P17		(1 << 17)
/** PIOA_PIO_PPDER_P16 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P16		(1 << 16)
/** PIOA_PIO_PPDER_P15 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P15		(1 << 15)
/** PIOA_PIO_PPDER_P14 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P14		(1 << 14)
/** PIOA_PIO_PPDER_P13 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P13		(1 << 13)
/** PIOA_PIO_PPDER_P12 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P12		(1 << 12)
/** PIOA_PIO_PPDER_P11 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P11		(1 << 11)
/** PIOA_PIO_PPDER_P10 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P10		(1 << 10)
/** PIOA_PIO_PPDER_P9 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P9		(1 << 9)
/** PIOA_PIO_PPDER_P8 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P8		(1 << 8)
/** PIOA_PIO_PPDER_P7 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P7		(1 << 7)
/** PIOA_PIO_PPDER_P6 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P6		(1 << 6)
/** PIOA_PIO_PPDER_P5 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P5		(1 << 5)
/** PIOA_PIO_PPDER_P4 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P4		(1 << 4)
/** PIOA_PIO_PPDER_P3 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P3		(1 << 3)
/** PIOA_PIO_PPDER_P2 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P2		(1 << 2)
/** PIOA_PIO_PPDER_P1 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P1		(1 << 1)
/** PIOA_PIO_PPDER_P0 Pull-Down Enable **/
#define PIOA_PIO_PPDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_ppdsr PIOPPDSR Pad Pull-down Status Register
@{*/

/** PIOA_PIO_PPDSR_P31 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P31		(1 << 31)
/** PIOA_PIO_PPDSR_P30 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P30		(1 << 30)
/** PIOA_PIO_PPDSR_P29 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P29		(1 << 29)
/** PIOA_PIO_PPDSR_P28 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P28		(1 << 28)
/** PIOA_PIO_PPDSR_P27 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P27		(1 << 27)
/** PIOA_PIO_PPDSR_P26 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P26		(1 << 26)
/** PIOA_PIO_PPDSR_P25 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P25		(1 << 25)
/** PIOA_PIO_PPDSR_P24 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P24		(1 << 24)
/** PIOA_PIO_PPDSR_P23 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P23		(1 << 23)
/** PIOA_PIO_PPDSR_P22 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P22		(1 << 22)
/** PIOA_PIO_PPDSR_P21 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P21		(1 << 21)
/** PIOA_PIO_PPDSR_P20 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P20		(1 << 20)
/** PIOA_PIO_PPDSR_P19 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P19		(1 << 19)
/** PIOA_PIO_PPDSR_P18 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P18		(1 << 18)
/** PIOA_PIO_PPDSR_P17 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P17		(1 << 17)
/** PIOA_PIO_PPDSR_P16 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P16		(1 << 16)
/** PIOA_PIO_PPDSR_P15 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P15		(1 << 15)
/** PIOA_PIO_PPDSR_P14 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P14		(1 << 14)
/** PIOA_PIO_PPDSR_P13 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P13		(1 << 13)
/** PIOA_PIO_PPDSR_P12 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P12		(1 << 12)
/** PIOA_PIO_PPDSR_P11 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P11		(1 << 11)
/** PIOA_PIO_PPDSR_P10 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P10		(1 << 10)
/** PIOA_PIO_PPDSR_P9 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P9		(1 << 9)
/** PIOA_PIO_PPDSR_P8 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P8		(1 << 8)
/** PIOA_PIO_PPDSR_P7 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P7		(1 << 7)
/** PIOA_PIO_PPDSR_P6 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P6		(1 << 6)
/** PIOA_PIO_PPDSR_P5 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P5		(1 << 5)
/** PIOA_PIO_PPDSR_P4 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P4		(1 << 4)
/** PIOA_PIO_PPDSR_P3 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P3		(1 << 3)
/** PIOA_PIO_PPDSR_P2 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P2		(1 << 2)
/** PIOA_PIO_PPDSR_P1 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P1		(1 << 1)
/** PIOA_PIO_PPDSR_P0 Pull-Down Status **/
#define PIOA_PIO_PPDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_ower PIOOWER Output Write Enable
@{*/

/** PIOA_PIO_OWER_P31 Output Write Enable **/
#define PIOA_PIO_OWER_P31		(1 << 31)
/** PIOA_PIO_OWER_P30 Output Write Enable **/
#define PIOA_PIO_OWER_P30		(1 << 30)
/** PIOA_PIO_OWER_P29 Output Write Enable **/
#define PIOA_PIO_OWER_P29		(1 << 29)
/** PIOA_PIO_OWER_P28 Output Write Enable **/
#define PIOA_PIO_OWER_P28		(1 << 28)
/** PIOA_PIO_OWER_P27 Output Write Enable **/
#define PIOA_PIO_OWER_P27		(1 << 27)
/** PIOA_PIO_OWER_P26 Output Write Enable **/
#define PIOA_PIO_OWER_P26		(1 << 26)
/** PIOA_PIO_OWER_P25 Output Write Enable **/
#define PIOA_PIO_OWER_P25		(1 << 25)
/** PIOA_PIO_OWER_P24 Output Write Enable **/
#define PIOA_PIO_OWER_P24		(1 << 24)
/** PIOA_PIO_OWER_P23 Output Write Enable **/
#define PIOA_PIO_OWER_P23		(1 << 23)
/** PIOA_PIO_OWER_P22 Output Write Enable **/
#define PIOA_PIO_OWER_P22		(1 << 22)
/** PIOA_PIO_OWER_P21 Output Write Enable **/
#define PIOA_PIO_OWER_P21		(1 << 21)
/** PIOA_PIO_OWER_P20 Output Write Enable **/
#define PIOA_PIO_OWER_P20		(1 << 20)
/** PIOA_PIO_OWER_P19 Output Write Enable **/
#define PIOA_PIO_OWER_P19		(1 << 19)
/** PIOA_PIO_OWER_P18 Output Write Enable **/
#define PIOA_PIO_OWER_P18		(1 << 18)
/** PIOA_PIO_OWER_P17 Output Write Enable **/
#define PIOA_PIO_OWER_P17		(1 << 17)
/** PIOA_PIO_OWER_P16 Output Write Enable **/
#define PIOA_PIO_OWER_P16		(1 << 16)
/** PIOA_PIO_OWER_P15 Output Write Enable **/
#define PIOA_PIO_OWER_P15		(1 << 15)
/** PIOA_PIO_OWER_P14 Output Write Enable **/
#define PIOA_PIO_OWER_P14		(1 << 14)
/** PIOA_PIO_OWER_P13 Output Write Enable **/
#define PIOA_PIO_OWER_P13		(1 << 13)
/** PIOA_PIO_OWER_P12 Output Write Enable **/
#define PIOA_PIO_OWER_P12		(1 << 12)
/** PIOA_PIO_OWER_P11 Output Write Enable **/
#define PIOA_PIO_OWER_P11		(1 << 11)
/** PIOA_PIO_OWER_P10 Output Write Enable **/
#define PIOA_PIO_OWER_P10		(1 << 10)
/** PIOA_PIO_OWER_P9 Output Write Enable **/
#define PIOA_PIO_OWER_P9		(1 << 9)
/** PIOA_PIO_OWER_P8 Output Write Enable **/
#define PIOA_PIO_OWER_P8		(1 << 8)
/** PIOA_PIO_OWER_P7 Output Write Enable **/
#define PIOA_PIO_OWER_P7		(1 << 7)
/** PIOA_PIO_OWER_P6 Output Write Enable **/
#define PIOA_PIO_OWER_P6		(1 << 6)
/** PIOA_PIO_OWER_P5 Output Write Enable **/
#define PIOA_PIO_OWER_P5		(1 << 5)
/** PIOA_PIO_OWER_P4 Output Write Enable **/
#define PIOA_PIO_OWER_P4		(1 << 4)
/** PIOA_PIO_OWER_P3 Output Write Enable **/
#define PIOA_PIO_OWER_P3		(1 << 3)
/** PIOA_PIO_OWER_P2 Output Write Enable **/
#define PIOA_PIO_OWER_P2		(1 << 2)
/** PIOA_PIO_OWER_P1 Output Write Enable **/
#define PIOA_PIO_OWER_P1		(1 << 1)
/** PIOA_PIO_OWER_P0 Output Write Enable **/
#define PIOA_PIO_OWER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_owdr PIOOWDR Output Write Disable
@{*/

/** PIOA_PIO_OWDR_P31 Output Write Disable **/
#define PIOA_PIO_OWDR_P31		(1 << 31)
/** PIOA_PIO_OWDR_P30 Output Write Disable **/
#define PIOA_PIO_OWDR_P30		(1 << 30)
/** PIOA_PIO_OWDR_P29 Output Write Disable **/
#define PIOA_PIO_OWDR_P29		(1 << 29)
/** PIOA_PIO_OWDR_P28 Output Write Disable **/
#define PIOA_PIO_OWDR_P28		(1 << 28)
/** PIOA_PIO_OWDR_P27 Output Write Disable **/
#define PIOA_PIO_OWDR_P27		(1 << 27)
/** PIOA_PIO_OWDR_P26 Output Write Disable **/
#define PIOA_PIO_OWDR_P26		(1 << 26)
/** PIOA_PIO_OWDR_P25 Output Write Disable **/
#define PIOA_PIO_OWDR_P25		(1 << 25)
/** PIOA_PIO_OWDR_P24 Output Write Disable **/
#define PIOA_PIO_OWDR_P24		(1 << 24)
/** PIOA_PIO_OWDR_P23 Output Write Disable **/
#define PIOA_PIO_OWDR_P23		(1 << 23)
/** PIOA_PIO_OWDR_P22 Output Write Disable **/
#define PIOA_PIO_OWDR_P22		(1 << 22)
/** PIOA_PIO_OWDR_P21 Output Write Disable **/
#define PIOA_PIO_OWDR_P21		(1 << 21)
/** PIOA_PIO_OWDR_P20 Output Write Disable **/
#define PIOA_PIO_OWDR_P20		(1 << 20)
/** PIOA_PIO_OWDR_P19 Output Write Disable **/
#define PIOA_PIO_OWDR_P19		(1 << 19)
/** PIOA_PIO_OWDR_P18 Output Write Disable **/
#define PIOA_PIO_OWDR_P18		(1 << 18)
/** PIOA_PIO_OWDR_P17 Output Write Disable **/
#define PIOA_PIO_OWDR_P17		(1 << 17)
/** PIOA_PIO_OWDR_P16 Output Write Disable **/
#define PIOA_PIO_OWDR_P16		(1 << 16)
/** PIOA_PIO_OWDR_P15 Output Write Disable **/
#define PIOA_PIO_OWDR_P15		(1 << 15)
/** PIOA_PIO_OWDR_P14 Output Write Disable **/
#define PIOA_PIO_OWDR_P14		(1 << 14)
/** PIOA_PIO_OWDR_P13 Output Write Disable **/
#define PIOA_PIO_OWDR_P13		(1 << 13)
/** PIOA_PIO_OWDR_P12 Output Write Disable **/
#define PIOA_PIO_OWDR_P12		(1 << 12)
/** PIOA_PIO_OWDR_P11 Output Write Disable **/
#define PIOA_PIO_OWDR_P11		(1 << 11)
/** PIOA_PIO_OWDR_P10 Output Write Disable **/
#define PIOA_PIO_OWDR_P10		(1 << 10)
/** PIOA_PIO_OWDR_P9 Output Write Disable **/
#define PIOA_PIO_OWDR_P9		(1 << 9)
/** PIOA_PIO_OWDR_P8 Output Write Disable **/
#define PIOA_PIO_OWDR_P8		(1 << 8)
/** PIOA_PIO_OWDR_P7 Output Write Disable **/
#define PIOA_PIO_OWDR_P7		(1 << 7)
/** PIOA_PIO_OWDR_P6 Output Write Disable **/
#define PIOA_PIO_OWDR_P6		(1 << 6)
/** PIOA_PIO_OWDR_P5 Output Write Disable **/
#define PIOA_PIO_OWDR_P5		(1 << 5)
/** PIOA_PIO_OWDR_P4 Output Write Disable **/
#define PIOA_PIO_OWDR_P4		(1 << 4)
/** PIOA_PIO_OWDR_P3 Output Write Disable **/
#define PIOA_PIO_OWDR_P3		(1 << 3)
/** PIOA_PIO_OWDR_P2 Output Write Disable **/
#define PIOA_PIO_OWDR_P2		(1 << 2)
/** PIOA_PIO_OWDR_P1 Output Write Disable **/
#define PIOA_PIO_OWDR_P1		(1 << 1)
/** PIOA_PIO_OWDR_P0 Output Write Disable **/
#define PIOA_PIO_OWDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_owsr PIOOWSR Output Write Status Register
@{*/

/** PIOA_PIO_OWSR_P31 Output Write Status **/
#define PIOA_PIO_OWSR_P31		(1 << 31)
/** PIOA_PIO_OWSR_P30 Output Write Status **/
#define PIOA_PIO_OWSR_P30		(1 << 30)
/** PIOA_PIO_OWSR_P29 Output Write Status **/
#define PIOA_PIO_OWSR_P29		(1 << 29)
/** PIOA_PIO_OWSR_P28 Output Write Status **/
#define PIOA_PIO_OWSR_P28		(1 << 28)
/** PIOA_PIO_OWSR_P27 Output Write Status **/
#define PIOA_PIO_OWSR_P27		(1 << 27)
/** PIOA_PIO_OWSR_P26 Output Write Status **/
#define PIOA_PIO_OWSR_P26		(1 << 26)
/** PIOA_PIO_OWSR_P25 Output Write Status **/
#define PIOA_PIO_OWSR_P25		(1 << 25)
/** PIOA_PIO_OWSR_P24 Output Write Status **/
#define PIOA_PIO_OWSR_P24		(1 << 24)
/** PIOA_PIO_OWSR_P23 Output Write Status **/
#define PIOA_PIO_OWSR_P23		(1 << 23)
/** PIOA_PIO_OWSR_P22 Output Write Status **/
#define PIOA_PIO_OWSR_P22		(1 << 22)
/** PIOA_PIO_OWSR_P21 Output Write Status **/
#define PIOA_PIO_OWSR_P21		(1 << 21)
/** PIOA_PIO_OWSR_P20 Output Write Status **/
#define PIOA_PIO_OWSR_P20		(1 << 20)
/** PIOA_PIO_OWSR_P19 Output Write Status **/
#define PIOA_PIO_OWSR_P19		(1 << 19)
/** PIOA_PIO_OWSR_P18 Output Write Status **/
#define PIOA_PIO_OWSR_P18		(1 << 18)
/** PIOA_PIO_OWSR_P17 Output Write Status **/
#define PIOA_PIO_OWSR_P17		(1 << 17)
/** PIOA_PIO_OWSR_P16 Output Write Status **/
#define PIOA_PIO_OWSR_P16		(1 << 16)
/** PIOA_PIO_OWSR_P15 Output Write Status **/
#define PIOA_PIO_OWSR_P15		(1 << 15)
/** PIOA_PIO_OWSR_P14 Output Write Status **/
#define PIOA_PIO_OWSR_P14		(1 << 14)
/** PIOA_PIO_OWSR_P13 Output Write Status **/
#define PIOA_PIO_OWSR_P13		(1 << 13)
/** PIOA_PIO_OWSR_P12 Output Write Status **/
#define PIOA_PIO_OWSR_P12		(1 << 12)
/** PIOA_PIO_OWSR_P11 Output Write Status **/
#define PIOA_PIO_OWSR_P11		(1 << 11)
/** PIOA_PIO_OWSR_P10 Output Write Status **/
#define PIOA_PIO_OWSR_P10		(1 << 10)
/** PIOA_PIO_OWSR_P9 Output Write Status **/
#define PIOA_PIO_OWSR_P9		(1 << 9)
/** PIOA_PIO_OWSR_P8 Output Write Status **/
#define PIOA_PIO_OWSR_P8		(1 << 8)
/** PIOA_PIO_OWSR_P7 Output Write Status **/
#define PIOA_PIO_OWSR_P7		(1 << 7)
/** PIOA_PIO_OWSR_P6 Output Write Status **/
#define PIOA_PIO_OWSR_P6		(1 << 6)
/** PIOA_PIO_OWSR_P5 Output Write Status **/
#define PIOA_PIO_OWSR_P5		(1 << 5)
/** PIOA_PIO_OWSR_P4 Output Write Status **/
#define PIOA_PIO_OWSR_P4		(1 << 4)
/** PIOA_PIO_OWSR_P3 Output Write Status **/
#define PIOA_PIO_OWSR_P3		(1 << 3)
/** PIOA_PIO_OWSR_P2 Output Write Status **/
#define PIOA_PIO_OWSR_P2		(1 << 2)
/** PIOA_PIO_OWSR_P1 Output Write Status **/
#define PIOA_PIO_OWSR_P1		(1 << 1)
/** PIOA_PIO_OWSR_P0 Output Write Status **/
#define PIOA_PIO_OWSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_aimer PIOAIMER Additional Interrupt Modes Enable Register
@{*/

/** PIOA_PIO_AIMER_P31 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P31		(1 << 31)
/** PIOA_PIO_AIMER_P30 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P30		(1 << 30)
/** PIOA_PIO_AIMER_P29 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P29		(1 << 29)
/** PIOA_PIO_AIMER_P28 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P28		(1 << 28)
/** PIOA_PIO_AIMER_P27 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P27		(1 << 27)
/** PIOA_PIO_AIMER_P26 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P26		(1 << 26)
/** PIOA_PIO_AIMER_P25 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P25		(1 << 25)
/** PIOA_PIO_AIMER_P24 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P24		(1 << 24)
/** PIOA_PIO_AIMER_P23 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P23		(1 << 23)
/** PIOA_PIO_AIMER_P22 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P22		(1 << 22)
/** PIOA_PIO_AIMER_P21 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P21		(1 << 21)
/** PIOA_PIO_AIMER_P20 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P20		(1 << 20)
/** PIOA_PIO_AIMER_P19 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P19		(1 << 19)
/** PIOA_PIO_AIMER_P18 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P18		(1 << 18)
/** PIOA_PIO_AIMER_P17 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P17		(1 << 17)
/** PIOA_PIO_AIMER_P16 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P16		(1 << 16)
/** PIOA_PIO_AIMER_P15 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P15		(1 << 15)
/** PIOA_PIO_AIMER_P14 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P14		(1 << 14)
/** PIOA_PIO_AIMER_P13 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P13		(1 << 13)
/** PIOA_PIO_AIMER_P12 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P12		(1 << 12)
/** PIOA_PIO_AIMER_P11 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P11		(1 << 11)
/** PIOA_PIO_AIMER_P10 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P10		(1 << 10)
/** PIOA_PIO_AIMER_P9 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P9		(1 << 9)
/** PIOA_PIO_AIMER_P8 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P8		(1 << 8)
/** PIOA_PIO_AIMER_P7 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P7		(1 << 7)
/** PIOA_PIO_AIMER_P6 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P6		(1 << 6)
/** PIOA_PIO_AIMER_P5 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P5		(1 << 5)
/** PIOA_PIO_AIMER_P4 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P4		(1 << 4)
/** PIOA_PIO_AIMER_P3 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P3		(1 << 3)
/** PIOA_PIO_AIMER_P2 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P2		(1 << 2)
/** PIOA_PIO_AIMER_P1 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P1		(1 << 1)
/** PIOA_PIO_AIMER_P0 Additional Interrupt Modes Enable **/
#define PIOA_PIO_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_aimdr PIOAIMDR Additional Interrupt Modes Disable Register
@{*/

